<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Appium and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.blackthroat.pkg.Appium</string>
	<key>Input</key>
	<dict>
		<key>PKG_ID</key>
		<string>io.appium.desktop</string>
		<key>NAME</key>
		<string>Appium</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.blackthroat.download.Appium</string>
	<key>Process</key>
 	<array>
 		<dict>
 			<key>Processor</key>
 			<string>PkgRootCreator</string>
 			<key>Arguments</key>
 			<dict>
 				<key>pkgroot</key>
 				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
 				<key>pkgdirs</key>
 				<dict>
 					<key>Applications</key>
 					<string>0775</string>
 				</dict>
 			</dict>
 		</dict>
 		<dict>
 			<key>Arguments</key>
 			<dict>
 			 	<key>destination_path</key>
				<string>%pkgroot%/Applications/Appium.app</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.dmg/Appium.app</string>
 			</dict>
 			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
 		 		<key>Arguments</key>
 				<dict>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>AppDmgVersioner</string>
 		</dict>
 		<dict>
 			<key>Processor</key>
 			<string>PkgCreator</string>
 			<key>Arguments</key>
 			<dict>
 				<key>pkg_request</key>
 				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
 					<key>pkgdir</key>
 					<string>%RECIPE_CACHE_DIR%</string>
 					<key>id</key>
 					<string>%PKG_ID%</string>
 					<key>chown</key>
 					<array>
 						<dict>
 							<key>path</key>
 							<string>Applications</string>
 							<key>user</key>
 							<string>root</string>
 							<key>group</key>
 							<string>admin</string>
 						</dict>
 					</array>
 				</dict>
 			</dict>
 		</dict>
 	</array>
 </dict>
 </plist>
