<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of The Welkin Suite.</string>
	<key>Identifier</key>
	<string>com.github.blackthroat.download.WelkinSuite</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WelkinSuite</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://welkinsuite.com/downloads/</string>
				<key>re_pattern</key>
				<string>(mac\/.*?\.pkg)</string>
			</dict>
			<key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
            	<key>filename</key>
                <string>%NAME%.pkg</string>
                <key>url</key>
                <string>https://builds.welkinsuite.com/%match%</string>
                <key>CHECK_FILESIZE_ONLY</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
 				<key>expected_authority_names</key>
        		<array>
            		<string>Developer ID Installer: West Ridge Software Limited (8K9ULE3452)</string>
            		<string>Developer ID Certification Authority</string>
            		<string>Apple Root CA</string>
        		</array>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>