<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Dashblock.</string>
	<key>Identifier</key>
	<string>com.github.blackthroat.download.Dashblock</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>dashblock/desktop-releases</string>
		<key>NAME</key>
		<string>Dashblock</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Dashblock's webpage and GitHub repo are offline, so it's likely app development has ended. This recipe is deprecated and will be removed in the future.</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>.*\.zip$</string>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-mac.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Dashblock.app</string>
				<key>requirement</key>
				<string>identifier "com.dashblock.desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = TG7H9D7DP4</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Dashblock.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
