<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports DBeaver Community Edition into Munki.</string>
	<key>Identifier</key>
	<string>com.github.blackthroat.munki.DBeaverCE</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>DBeaver</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>DBeaverCE</string>
		<!--See ParentRecipe for OS options-->
		<key>os</key>
		<string></string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Free multi-platform database tool for developers, SQL programmers, database administrators and analysts. Supports all popular databases: MySQL, PostgreSQL, MariaDB, SQLite, Oracle, DB2, SQL Server, Sybase, MS Access, Teradata, Firebird, Derby, etc.</string>
			<key>developer</key>
			<string>DBeaver Corp</string>
			<key>display_name</key>
			<string>DBeaver Community Edition</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.DBeaverCE</string>
	<key>Process</key>
	<array>
		<dict>
		    <key>Arguments</key>
		    <dict>
			<key>input_path</key>
			<string>%pathname%</string>
			<key>expected_authority_names</key>
			<array>
			    <string>Developer ID Installer: DBeaver Corporation (42B6MDKMW8)</string>
			    <string>Developer ID Certification Authority</string>
			    <string>Apple Root CA</string>
			</array>
		    </dict>
		    <key>Processor</key>
		    <string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
